saitejanomula7797/stm32_Drivers_Development/drivers/Inc/stm32407xx.h
/*
 * stm32407xx.h
 *
 *  Created on: Jun 2, 2026
 *      Author: nomul
 *
 *  Register structs sourced from:
 *    - RM0090 Rev 21: STM32F405/407/415/417/427/429/437/439 Reference Manual
 *    - DS8626 Rev 12: STM32F405xx / STM32F407xx Datasheet
 */

#ifndef STM32407XX_H_
#define STM32407XX_H_

#include <stdint.h>

/*===========================================================================
 * 0. BASE ADDRESSES OF FLASH AND SRAM MEMORIES
 *    Source: RM0090 §2.3 / DS8626 Fig.18 memory map
 *===========================================================================*/





/**********************************START:Processor Specific Details **********************************/
/*
 * ARM Cortex Mx Processor NVIC ISERx Register Addresses
 */
#define NVIC_ISER0      ( (__vo uint32_t*)0xE000E100 )
#define NVIC_ISER1      ( (__vo uint32_t*)0xE000E104 )
#define NVIC_ISER2      ( (__vo uint32_t*)0xE000E108 )
#define NVIC_ISER3      ( (__vo uint32_t*)0xE000E10C )
#define NVIC_ISER4      ( (__vo uint32_t*)0xE000E110 )
#define NVIC_ISER5      ( (__vo uint32_t*)0xE000E114 )
#define NVIC_ISER6      ( (__vo uint32_t*)0xE000E118 )
#define NVIC_ISER7      ( (__vo uint32_t*)0xE000E11C )


/*
 * ARM Cortex Mx Processor NVIC ICERx Register Addresses
 */
#define NVIC_ICER0      ( (__vo uint32_t*)0XE000E180 )
#define NVIC_ICER1      ( (__vo uint32_t*)0XE000E184 )
#define NVIC_ICER2      ( (__vo uint32_t*)0XE000E188 )
#define NVIC_ICER3      ( (__vo uint32_t*)0XE000E18C )
#define NVIC_ICER4      ( (__vo uint32_t*)0XE000E190 )
#define NVIC_ICER5      ( (__vo uint32_t*)0XE000E194 )
#define NVIC_ICER6      ( (__vo uint32_t*)0XE000E198 )
#define NVIC_ICER7      ( (__vo uint32_t*)0XE000E19C )


/*
 * ARM Cortex Mx Processor Priority Register Address Calculation
 */
#define NVIC_PR_BASE_ADDR   ( (__vo uint32_t*)0XE000E400


/*
 * ARM Cortex Mx Processor number of priority bits implemented in Priority Register
 */
#define NO_PR_BITS_IMPLEMENTED  4
/*
 * FLASH_BASEADDR (0x0800 0000)
 *   Main Flash memory — up to 1 MB on STM32F407xx.
 *   Accessed via ICode/DCode buses.
 */
#define FLASH_BASEADDR          0x08000000U

/*
 * SRAM1_BASEADDR (0x2000 0000)
 *   Main embedded SRAM, 112 KB. Accessible by all AHB masters.
 */
#define SRAM1_BASEADDR          0x20000000U

/*
 * SRAM2_BASEADDR (0x2001 C000)
 *   Auxiliary embedded SRAM, 16 KB.
 *   Follows SRAM1 immediately (112 KB = 0x1C000 bytes).
 */
#define SRAM2_BASEADDR          0x2001C000U

/*
 * ROM_BASEADDR (0x1FFF 0000)  — System Memory / Bootloader
 *   Factory-programmed read-only bootloader + 512 bytes OTP.
 *   Selected as boot space when BOOT1=0, BOOT0=1.
 */
#define ROM_BASEADDR            0x1FFF0000U

/* Convenience alias */
#define SRAM                    SRAM1_BASEADDR


/*===========================================================================
 * 1. BUS BASE ADDRESSES
 *===========================================================================*/
#define PERIPH_BASE             0x40000000U
#define APB1PERIPH_BASE         PERIPH_BASE             /* 0x4000 0000 */
#define APB2PERIPH_BASE         0x40010000U             /* 0x4001 0000 */
#define AHB1PERIPH_BASE         0x40020000U             /* 0x4002 0000 */
#define AHB2PERIPH_BASE         0x50000000U             /* 0x5000 0000 */


/*===========================================================================
 * 2. AHB1 PERIPHERAL BASE ADDRESSES
 *===========================================================================*/
#define GPIOA_BASEADDR          (AHB1PERIPH_BASE + 0x0000U)   /* 0x4002 0000 */
#define GPIOB_BASEADDR          (AHB1PERIPH_BASE + 0x0400U)   /* 0x4002 0400 */
#define GPIOC_BASEADDR          (AHB1PERIPH_BASE + 0x0800U)   /* 0x4002 0800 */
#define GPIOD_BASEADDR          (AHB1PERIPH_BASE + 0x0C00U)   /* 0x4002 0C00 */
#define GPIOE_BASEADDR          (AHB1PERIPH_BASE + 0x1000U)   /* 0x4002 1000 */
#define GPIOF_BASEADDR          (AHB1PERIPH_BASE + 0x1400U)   /* 0x4002 1400 */
#define GPIOG_BASEADDR          (AHB1PERIPH_BASE + 0x1800U)   /* 0x4002 1800 */
#define GPIOH_BASEADDR          (AHB1PERIPH_BASE + 0x1C00U)   /* 0x4002 1C00 */
#define GPIOI_BASEADDR          (AHB1PERIPH_BASE + 0x2000U)   /* 0x4002 2000 */

#define CRC_BASEADDR            (AHB1PERIPH_BASE + 0x3000U)   /* 0x4002 3000 */
#define RCC_BASEADDR            (AHB1PERIPH_BASE + 0x3800U)   /* 0x4002 3800 */
#define FLASH_IF_BASEADDR       (AHB1PERIPH_BASE + 0x3C00U)   /* 0x4002 3C00 */
#define BKPSRAM_BASEADDR        (AHB1PERIPH_BASE + 0x4000U)   /* 0x4002 4000 */
#define DMA1_BASEADDR           (AHB1PERIPH_BASE + 0x6000U)   /* 0x4002 6000 */
#define DMA2_BASEADDR           (AHB1PERIPH_BASE + 0x6400U)   /* 0x4002 6400 */
#define ETHERNET_MAC_BASEADDR   (AHB1PERIPH_BASE + 0x8000U)   /* 0x4002 8000 */
#define USB_OTG_HS_BASEADDR     0x40040000U                   /* 0x4004 0000 */


/*===========================================================================
 * 3. AHB2 PERIPHERAL BASE ADDRESSES
 *===========================================================================*/
#define USB_OTG_FS_BASEADDR     (AHB2PERIPH_BASE + 0x00000U)  /* 0x5000 0000 */
#define DCMI_BASEADDR           (AHB2PERIPH_BASE + 0x50000U)  /* 0x5005 0000 */
#define CRYP_BASEADDR           (AHB2PERIPH_BASE + 0x60000U)  /* 0x5006 0000 */
#define HASH_BASEADDR           (AHB2PERIPH_BASE + 0x60400U)  /* 0x5006 0400 */
#define RNG_BASEADDR            (AHB2PERIPH_BASE + 0x60800U)  /* 0x5006 0800 */


/*===========================================================================
 * 4. APB1 PERIPHERAL BASE ADDRESSES  (max 42 MHz)
 *===========================================================================*/
#define TIM2_BASEADDR           (APB1PERIPH_BASE + 0x0000U)
#define TIM3_BASEADDR           (APB1PERIPH_BASE + 0x0400U)
#define TIM4_BASEADDR           (APB1PERIPH_BASE + 0x0800U)
#define TIM5_BASEADDR           (APB1PERIPH_BASE + 0x0C00U)
#define TIM6_BASEADDR           (APB1PERIPH_BASE + 0x1000U)
#define TIM7_BASEADDR           (APB1PERIPH_BASE + 0x1400U)
#define TIM12_BASEADDR          (APB1PERIPH_BASE + 0x1800U)
#define TIM13_BASEADDR          (APB1PERIPH_BASE + 0x1C00U)
#define TIM14_BASEADDR          (APB1PERIPH_BASE + 0x2000U)
#define RTC_BKP_BASEADDR        (APB1PERIPH_BASE + 0x2800U)
#define WWDG_BASEADDR           (APB1PERIPH_BASE + 0x2C00U)
#define IWDG_BASEADDR           (APB1PERIPH_BASE + 0x3000U)
#define I2S2EXT_BASEADDR        (APB1PERIPH_BASE + 0x3400U)
#define SPI2_I2S2_BASEADDR      (APB1PERIPH_BASE + 0x3800U)
#define SPI3_I2S3_BASEADDR      (APB1PERIPH_BASE + 0x3C00U)
#define I2S3EXT_BASEADDR        (APB1PERIPH_BASE + 0x4000U)
#define USART2_BASEADDR         (APB1PERIPH_BASE + 0x4400U)
#define USART3_BASEADDR         (APB1PERIPH_BASE + 0x4800U)
#define UART4_BASEADDR          (APB1PERIPH_BASE + 0x4C00U)
#define UART5_BASEADDR          (APB1PERIPH_BASE + 0x5000U)
#define I2C1_BASEADDR           (APB1PERIPH_BASE + 0x5400U)
#define I2C2_BASEADDR           (APB1PERIPH_BASE + 0x5800U)
#define I2C3_BASEADDR           (APB1PERIPH_BASE + 0x5C00U)
#define CAN1_BASEADDR           (APB1PERIPH_BASE + 0x6400U)
#define CAN2_BASEADDR           (APB1PERIPH_BASE + 0x6800U)
#define PWR_BASEADDR            (APB1PERIPH_BASE + 0x7000U)
#define DAC_BASEADDR            (APB1PERIPH_BASE + 0x7400U)
#define UART7_BASEADDR          (APB1PERIPH_BASE + 0x7800U)
#define UART8_BASEADDR          (APB1PERIPH_BASE + 0x7C00U)


/*===========================================================================
 * 5. APB2 PERIPHERAL BASE ADDRESSES  (max 84 MHz)
 *===========================================================================*/
#define TIM1_BASEADDR           (APB2PERIPH_BASE + 0x0000U)
#define TIM8_BASEADDR           (APB2PERIPH_BASE + 0x0400U)
#define USART1_BASEADDR         (APB2PERIPH_BASE + 0x1000U)
#define USART6_BASEADDR         (APB2PERIPH_BASE + 0x1400U)
#define ADC1_ADC2_ADC3_BASEADDR (APB2PERIPH_BASE + 0x2000U)
#define SDIO_BASEADDR           (APB2PERIPH_BASE + 0x2C00U)
#define SPI1_BASEADDR           (APB2PERIPH_BASE + 0x3000U)
#define SPI4_BASEADDR           (APB2PERIPH_BASE + 0x3400U)
#define SYSCFG_BASEADDR         (APB2PERIPH_BASE + 0x3800U)
#define EXTI_BASEADDR           (APB2PERIPH_BASE + 0x3C00U)
#define TIM9_BASEADDR           (APB2PERIPH_BASE + 0x4000U)
#define TIM10_BASEADDR          (APB2PERIPH_BASE + 0x4400U)
#define TIM11_BASEADDR          (APB2PERIPH_BASE + 0x4800U)
#define SPI5_BASEADDR           (APB2PERIPH_BASE + 0x5000U)
#define SPI6_BASEADDR           (APB2PERIPH_BASE + 0x5400U)
#define SAI1_BASEADDR           (APB2PERIPH_BASE + 0x5800U)


/*===========================================================================
 * 6. CONVENIENCE ALIASES
 *===========================================================================*/
#define SPI2_BASEADDR           SPI2_I2S2_BASEADDR
#define SPI3_BASEADDR           SPI3_I2S3_BASEADDR


/*===========================================================================
 * 7. PERIPHERAL REGISTER STRUCTURE DEFINITIONS
 *    Source: RM0090 Rev 21 register map tables
 *===========================================================================*/

