saitejanomula7797/stm32_Drivers_Development/drivers/Inc/stm32407xx.h
/*---------------------------------------------------------------------------
 * 7.1  GPIO  (RM0090 Table 40, §8.4.11, p.290)
 *      Each GPIOx peripheral is 0x400 bytes; registers are 32-bit.
 *---------------------------------------------------------------------------*/
typedef struct
{
    volatile uint32_t MODER;    /*!< GPIO port mode register,               Address offset: 0x00 */
    volatile uint32_t OTYPER;   /*!< GPIO port output type register,         Address offset: 0x04 */
    volatile uint32_t OSPEEDR;  /*!< GPIO port output speed register,        Address offset: 0x08 */
    volatile uint32_t PUPDR;    /*!< GPIO port pull-up/pull-down register,   Address offset: 0x0C */
    volatile uint32_t IDR;      /*!< GPIO port input data register,          Address offset: 0x10 */
    volatile uint32_t ODR;      /*!< GPIO port output data register,         Address offset: 0x14 */
    volatile uint32_t BSRR;     /*!< GPIO port bit set/reset register,       Address offset: 0x18 */
    volatile uint32_t LCKR;     /*!< GPIO port configuration lock register,  Address offset: 0x1C */
    volatile uint32_t AFR[2];   /*!< AFR[0]: GPIO alternate function low register  (offset 0x20)
                                     AFR[1]: GPIO alternate function high register (offset 0x24) */
} GPIO_RegDef_t;


/*---------------------------------------------------------------------------
 * 7.2  RCC  (RM0090 Table 35, §7.3.24, p.267-269)
 *      RCC peripheral base: 0x4002 3800
 *---------------------------------------------------------------------------*/
typedef struct
{
    volatile uint32_t CR;           /*!< RCC clock control register,                          offset: 0x00 */
    volatile uint32_t PLLCFGR;      /*!< RCC PLL configuration register,                      offset: 0x04 */
    volatile uint32_t CFGR;         /*!< RCC clock configuration register,                    offset: 0x08 */
    volatile uint32_t CIR;          /*!< RCC clock interrupt register,                        offset: 0x0C */
    volatile uint32_t AHB1RSTR;     /*!< RCC AHB1 peripheral reset register,                  offset: 0x10 */
    volatile uint32_t AHB2RSTR;     /*!< RCC AHB2 peripheral reset register,                  offset: 0x14 */
    volatile uint32_t AHB3RSTR;     /*!< RCC AHB3 peripheral reset register,                  offset: 0x18 */
    uint32_t          RESERVED0;    /*!< Reserved,                                            offset: 0x1C */
    volatile uint32_t APB1RSTR;     /*!< RCC APB1 peripheral reset register,                  offset: 0x20 */
    volatile uint32_t APB2RSTR;     /*!< RCC APB2 peripheral reset register,                  offset: 0x24 */
    uint32_t          RESERVED1[2]; /*!< Reserved,                                    offsets: 0x28, 0x2C */
    volatile uint32_t AHB1ENR;      /*!< RCC AHB1 peripheral clock enable register,           offset: 0x30 */
    volatile uint32_t AHB2ENR;      /*!< RCC AHB2 peripheral clock enable register,           offset: 0x34 */
    volatile uint32_t AHB3ENR;      /*!< RCC AHB3 peripheral clock enable register,           offset: 0x38 */
    uint32_t          RESERVED2;    /*!< Reserved,                                            offset: 0x3C */
    volatile uint32_t APB1ENR;      /*!< RCC APB1 peripheral clock enable register,           offset: 0x40 */
    volatile uint32_t APB2ENR;      /*!< RCC APB2 peripheral clock enable register,           offset: 0x44 */
    uint32_t          RESERVED3[2]; /*!< Reserved,                                    offsets: 0x48, 0x4C */
    volatile uint32_t AHB1LPENR;    /*!< RCC AHB1 peripheral clock enable in low power mode,  offset: 0x50 */
    volatile uint32_t AHB2LPENR;    /*!< RCC AHB2 peripheral clock enable in low power mode,  offset: 0x54 */
    volatile uint32_t AHB3LPENR;    /*!< RCC AHB3 peripheral clock enable in low power mode,  offset: 0x58 */
    uint32_t          RESERVED4;    /*!< Reserved,                                            offset: 0x5C */
    volatile uint32_t APB1LPENR;    /*!< RCC APB1 peripheral clock enable in low power mode,  offset: 0x60 */
    volatile uint32_t APB2LPENR;    /*!< RCC APB2 peripheral clock enable in low power mode,  offset: 0x64 */
    uint32_t          RESERVED5[2]; /*!< Reserved,                                    offsets: 0x68, 0x6C */
    volatile uint32_t BDCR;         /*!< RCC backup domain control register,                  offset: 0x70 */
    volatile uint32_t CSR;          /*!< RCC clock control & status register,                 offset: 0x74 */
    uint32_t          RESERVED6[2]; /*!< Reserved,                                    offsets: 0x78, 0x7C */
    volatile uint32_t SSCGR;        /*!< RCC spread spectrum clock generation register,       offset: 0x80 */
    volatile uint32_t PLLI2SCFGR;   /*!< RCC PLLI2S configuration register,                  offset: 0x84 */
} RCC_RegDef_t;


/*---------------------------------------------------------------------------
 * 7.3  EXTI  (RM0090 Table 64, §12.3.7, p.390)
 *      EXTI peripheral base: 0x4001 3C00
 *---------------------------------------------------------------------------*/
typedef struct
{
    volatile uint32_t IMR;    /*!< Interrupt mask register,            Address offset: 0x00 */
    volatile uint32_t EMR;    /*!< Event mask register,                Address offset: 0x04 */
    volatile uint32_t RTSR;   /*!< Rising trigger selection register,  Address offset: 0x08 */
    volatile uint32_t FTSR;   /*!< Falling trigger selection register, Address offset: 0x0C */
    volatile uint32_t SWIER;  /*!< Software interrupt event register,  Address offset: 0x10 */
    volatile uint32_t PR;     /*!< Pending register,                   Address offset: 0x14 */
} EXTI_RegDef_t;


/*---------------------------------------------------------------------------
 * 7.4  SYSCFG  (RM0090 Table 41, §9.2.8, p.292-296)
 *      SYSCFG peripheral base: 0x4001 3800
 *---------------------------------------------------------------------------*/
typedef struct
{
    volatile uint32_t MEMRMP;       /*!< SYSCFG memory remap register,                         offset: 0x00 */
    volatile uint32_t PMC;          /*!< SYSCFG peripheral mode configuration register,         offset: 0x04 */
    volatile uint32_t EXTICR[4];    /*!< SYSCFG external interrupt config registers 1-4,
                                         EXTICR[0] = EXTICR1 offset 0x08,
                                         EXTICR[1] = EXTICR2 offset 0x0C,
                                         EXTICR[2] = EXTICR3 offset 0x10,
                                         EXTICR[3] = EXTICR4 offset 0x14               offsets: 0x08-0x14 */
    uint32_t          RESERVED[2];  /*!< Reserved,                                     offsets: 0x18, 0x1C */
    volatile uint32_t CMPCR;        /*!< Compensation cell control register,                    offset: 0x20 */
} SYSCFG_RegDef_t;


