saitejanomula7797/stm32_Drivers_Development/drivers/Inc/stm32407xx.h
/*---------------------------------------------------------------------------
 * 7.5  SPI / I2S  (RM0090 Table 130, §28.5.10, p.928)
 *      Applies to: SPI1, SPI2/I2S2, SPI3/I2S3, SPI4
 *---------------------------------------------------------------------------*/
typedef struct
{
    volatile uint32_t CR1;      /*!< SPI control register 1 (not used in I2S mode),  offset: 0x00 */
    volatile uint32_t CR2;      /*!< SPI control register 2,                          offset: 0x04 */
    volatile uint32_t SR;       /*!< SPI status register,                             offset: 0x08 */
    volatile uint32_t DR;       /*!< SPI data register,                               offset: 0x0C */
    volatile uint32_t CRCPR;    /*!< SPI CRC polynomial register (not in I2S mode),   offset: 0x10 */
    volatile uint32_t RXCRCR;   /*!< SPI RX CRC register (not in I2S mode),           offset: 0x14 */
    volatile uint32_t TXCRCR;   /*!< SPI TX CRC register (not in I2S mode),           offset: 0x18 */
    volatile uint32_t I2SCFGR;  /*!< SPI_I2S configuration register,                 offset: 0x1C */
    volatile uint32_t I2SPR;    /*!< SPI_I2S prescaler register,                      offset: 0x20 */
} SPI_RegDef_t;



/******************************************************************************************
 *			Bit position definitions of SPI peripheral
 ******************************************************************************************/
/*
 * Bit position definitions SPI_CR1
 */
#define SPI_CR1_CPHA        0
#define SPI_CR1_CPOL        1
#define SPI_CR1_MSTR        2
#define SPI_CR1_BR          3
#define SPI_CR1_SPE         6
#define SPI_CR1_LSB_FIRST   7
#define SPI_CR1_SSI         8
#define SPI_CR1_SSM         9
#define SPI_CR1_RX_ONLY     10
#define SPI_CR1_DFF         11
#define SPI_CR1_CRC_NEXT    12
#define SPI_CR1_CRC_EN      13
#define SPI_CR1_BIDI_OE     14
#define SPI_CR1_BIDI_MODE   15


/*---------------------------------------------------------------------------
 * 7.6  I2C  (RM0090 Table 126, §27.6.11, p.875)
 *      Applies to: I2C1, I2C2, I2C3
 *---------------------------------------------------------------------------*/
typedef struct
{
    volatile uint32_t CR1;    /*!< I2C control register 1,     Address offset: 0x00 */
    volatile uint32_t CR2;    /*!< I2C control register 2,     Address offset: 0x04 */
    volatile uint32_t OAR1;   /*!< I2C own address register 1, Address offset: 0x08 */
    volatile uint32_t OAR2;   /*!< I2C own address register 2, Address offset: 0x0C */
    volatile uint32_t DR;     /*!< I2C data register,          Address offset: 0x10 */
    volatile uint32_t SR1;    /*!< I2C status register 1,      Address offset: 0x14 */
    volatile uint32_t SR2;    /*!< I2C status register 2,      Address offset: 0x18 */
    volatile uint32_t CCR;    /*!< I2C clock control register, Address offset: 0x1C */
    volatile uint32_t TRISE;  /*!< I2C TRISE register,         Address offset: 0x20 */
    volatile uint32_t FLTR;   /*!< I2C FLTR register,          Address offset: 0x24 */
} I2C_RegDef_t;


/*---------------------------------------------------------------------------
 * 7.7  USART / UART  (RM0090 Table 150, §30.6.8, p.1021)
 *      Applies to: USART1, USART2, USART3, UART4, UART5, USART6
 *---------------------------------------------------------------------------*/
typedef struct
{
    volatile uint32_t SR;    /*!< USART status register,                   Address offset: 0x00 */
    volatile uint32_t DR;    /*!< USART data register,                     Address offset: 0x04 */
    volatile uint32_t BRR;   /*!< USART baud rate register,                Address offset: 0x08 */
    volatile uint32_t CR1;   /*!< USART control register 1,                Address offset: 0x0C */
    volatile uint32_t CR2;   /*!< USART control register 2,                Address offset: 0x10 */
    volatile uint32_t CR3;   /*!< USART control register 3,                Address offset: 0x14 */
    volatile uint32_t GTPR;  /*!< USART guard time and prescaler register, Address offset: 0x18 */
} USART_RegDef_t;


/*===========================================================================
 * 8. PERIPHERAL DECLARATIONS  (pointer-cast to base address)
 *===========================================================================*/

/* GPIO */
#define GPIOA   ((GPIO_RegDef_t *)  GPIOA_BASEADDR)
#define GPIOB   ((GPIO_RegDef_t *)  GPIOB_BASEADDR)
#define GPIOC   ((GPIO_RegDef_t *)  GPIOC_BASEADDR)
#define GPIOD   ((GPIO_RegDef_t *)  GPIOD_BASEADDR)
#define GPIOE   ((GPIO_RegDef_t *)  GPIOE_BASEADDR)
#define GPIOF   ((GPIO_RegDef_t *)  GPIOF_BASEADDR)
#define GPIOG   ((GPIO_RegDef_t *)  GPIOG_BASEADDR)
#define GPIOH   ((GPIO_RegDef_t *)  GPIOH_BASEADDR)
#define GPIOI   ((GPIO_RegDef_t *)  GPIOI_BASEADDR)

/* RCC */
#define RCC     ((RCC_RegDef_t *)   RCC_BASEADDR)

/* EXTI */
#define EXTI    ((EXTI_RegDef_t *)  EXTI_BASEADDR)

/* SYSCFG */
#define SYSCFG  ((SYSCFG_RegDef_t *)SYSCFG_BASEADDR)

/* SPI */
#define SPI1    ((SPI_RegDef_t *)   SPI1_BASEADDR)
#define SPI2    ((SPI_RegDef_t *)   SPI2_BASEADDR)
#define SPI3    ((SPI_RegDef_t *)   SPI3_BASEADDR)
#define SPI4    ((SPI_RegDef_t *)   SPI4_BASEADDR)

/* I2C */
#define I2C1    ((I2C_RegDef_t *)   I2C1_BASEADDR)
#define I2C2    ((I2C_RegDef_t *)   I2C2_BASEADDR)
#define I2C3    ((I2C_RegDef_t *)   I2C3_BASEADDR)

/* USART / UART */
#define USART1  ((USART_RegDef_t *) USART1_BASEADDR)
#define USART2  ((USART_RegDef_t *) USART2_BASEADDR)
#define USART3  ((USART_RegDef_t *) USART3_BASEADDR)
#define UART4   ((USART_RegDef_t *) UART4_BASEADDR)
#define UART5   ((USART_RegDef_t *) UART5_BASEADDR)
#define USART6  ((USART_RegDef_t *) USART6_BASEADDR)


/*===========================================================================
 * 9. RCC CLOCK ENABLE MACROS  (RCC_AHB1ENR / APB1ENR / APB2ENR)
 *    Source: RM0090 §7.3.10, 7.3.13, 7.3.14
 *===========================================================================*/

/* AHB1 — GPIO clock enables */
#define GPIOA_PCLK_EN()     (RCC->AHB1ENR |= (1U << 0))
#define GPIOB_PCLK_EN()     (RCC->AHB1ENR |= (1U << 1))
#define GPIOC_PCLK_EN()     (RCC->AHB1ENR |= (1U << 2))
#define GPIOD_PCLK_EN()     (RCC->AHB1ENR |= (1U << 3))
#define GPIOE_PCLK_EN()     (RCC->AHB1ENR |= (1U << 4))
#define GPIOF_PCLK_EN()     (RCC->AHB1ENR |= (1U << 5))
#define GPIOG_PCLK_EN()     (RCC->AHB1ENR |= (1U << 6))
#define GPIOH_PCLK_EN()     (RCC->AHB1ENR |= (1U << 7))
#define GPIOI_PCLK_EN()     (RCC->AHB1ENR |= (1U << 8))

/* APB1 — I2C clock enables */
#define I2C1_PCLK_EN()      (RCC->APB1ENR |= (1U << 21))
#define I2C2_PCLK_EN()      (RCC->APB1ENR |= (1U << 22))
#define I2C3_PCLK_EN()      (RCC->APB1ENR |= (1U << 23))

/* APB1 — SPI clock enables */
#define SPI2_PCLK_EN()      (RCC->APB1ENR |= (1U << 14))
#define SPI3_PCLK_EN()      (RCC->APB1ENR |= (1U << 15))

/* APB2 — SPI clock enables */
#define SPI1_PCLK_EN()      (RCC->APB2ENR |= (1U << 12))
#define SPI4_PCLK_EN()      (RCC->APB2ENR |= (1U << 13))

/* APB1 — USART/UART clock enables */
#define USART2_PCLK_EN()    (RCC->APB1ENR |= (1U << 17))
#define USART3_PCLK_EN()    (RCC->APB1ENR |= (1U << 18))
#define UART4_PCLK_EN()     (RCC->APB1ENR |= (1U << 19))
#define UART5_PCLK_EN()     (RCC->APB1ENR |= (1U << 20))

/* APB2 — USART clock enables */
#define USART1_PCLK_EN()    (RCC->APB2ENR |= (1U << 4))
#define USART6_PCLK_EN()    (RCC->APB2ENR |= (1U << 5))

/* APB2 — SYSCFG clock enable */
#define SYSCFG_PCLK_EN()    (RCC->APB2ENR |= (1U << 14))


/*===========================================================================
 * 10. RCC CLOCK DISABLE MACROS
 *===========================================================================*/


