saitejanomula7797/stm32_Drivers_Development/drivers/Inc/stm32407xx.h
/*
 * IRQ(Interrupt Request) Numbers of STM32F446x MCU
 * NOTE: Update these macros with valid values according to your MCU
 */
#define IRQ_NO_WWDG                 0   /* Window Watchdog interrupt                                            */
#define IRQ_NO_PVD                  1   /* PVD through EXTI line detection interrupt                            */
#define IRQ_NO_TAMP_STAMP           2   /* Tamper and Time stamp interrupts through EXTI line                   */
#define IRQ_NO_RTC_WKUP             3   /* RTC Wakeup interrupt through EXTI line                               */
#define IRQ_NO_FLASH                4   /* Flash global interrupt                                               */
#define IRQ_NO_RCC                  5   /* RCC global interrupt                                                 */
#define IRQ_NO_EXTI0                6   /* EXTI Line0 interrupt                                                 */
#define IRQ_NO_EXTI1                7   /* EXTI Line1 interrupt                                                 */
#define IRQ_NO_EXTI2                8   /* EXTI Line2 interrupt                                                 */
#define IRQ_NO_EXTI3                9   /* EXTI Line3 interrupt                                                 */
#define IRQ_NO_EXTI4                10  /* EXTI Line4 interrupt                                                 */
#define IRQ_NO_DMA1_STREAM0         11  /* DMA1 Stream0 interrupt                                               */
#define IRQ_NO_DMA1_STREAM1         12  /* DMA1 Stream1 interrupt                                               */
#define IRQ_NO_DMA1_STREAM2         13  /* DMA1 Stream2 interrupt                                               */
#define IRQ_NO_DMA1_STREAM3         14  /* DMA1 Stream3 interrupt                                               */
#define IRQ_NO_DMA1_STREAM4         15  /* DMA1 Stream4 interrupt                                               */
#define IRQ_NO_DMA1_STREAM5         16  /* DMA1 Stream5 interrupt                                               */
#define IRQ_NO_DMA1_STREAM6         17  /* DMA1 Stream6 interrupt                                               */
#define IRQ_NO_ADC                  18  /* ADC1, ADC2 and ADC3 global interrupts                                */
#define IRQ_NO_CAN1_TX              19  /* CAN1 TX interrupts                                                   */
#define IRQ_NO_CAN1_RX0             20  /* CAN1 RX0 interrupts                                                  */
#define IRQ_NO_CAN1_RX1             21  /* CAN1 RX1 interrupts                                                  */
#define IRQ_NO_CAN1_SCE             22  /* CAN1 SCE interrupts                                                  */
#define IRQ_NO_EXTI9_5              23  /* EXTI Line[9:5] interrupts                                            */
#define	IRQ_NO_TIM1_BRK_TIM9        24  /* TIM1 Break interrupt and TIM9 global interrupt                       */
#define	IRQ_NO_TIM1_UP_TIM10        25  /* TIM1 Update interrupt and TIM10 global interrupt                     */
#define IRQ_NO_TIM1_TRG_COM_TIM11   26  /* TIM1 Trigger and Commutation interrupts and TIM11 global interrupt   */
#define IRQ_NO_TIM1_CC              27  /* TIM1 Capture Compare interrupt                                       */
#define IRQ_NO_TIM2                 28  /* TIM2 global interrupt                                                */
#define IRQ_NO_TIM3                 29  /* TIM3 global interrupt                                                */
#define IRQ_NO_TIM4                 30  /* TIM4 global interrupt                                                */
#define IRQ_NO_I2C1_EV              31  /* I2C1 event interrupt                                                 */
#define IRQ_NO_I2C1_ER              32  /* I2C1 error interrupt                                                 */
#define IRQ_NO_I2C2_EV              33  /* I2C2 event interrupt                                                 */
#define IRQ_NO_I2C2_ER              34  /* I2C2 error interrupt                                                 */
#define IRQ_NO_SPI1                 35  /* SPI1 global interrupt                                                */
#define IRQ_NO_SPI2                 36  /* SPI2 global interrupt                                                */
#define IRQ_NO_USART1               37  /* USART1 global interrupt                                              */
#define IRQ_NO_USART2               38  /* USART2 global interrupt                                              */
#define IRQ_NO_USART3               39  /* USART3 global interrupt                                              */
#define IRQ_NO_EXTI15_10            40  /* EXTI Line[15:10] interrupts                                          */
#define IRQ_NO_RTC_ALARM            41  /* RTC Alarms (A and B) through EXTI line interrupts                    */
#define IRQ_NO_OTG_FS_WKUP          42  /* USB On-The-Go FS Wakeup through EXTI line interrupt                  */
#define IRQ_NO_TIM8_BRK_TIM12       43  /* TIM8 Break interrupt and TIM12 global interrupt                      */
#define IRQ_NO_TIM8_UP_TIM13        44  /* TIM8 Update and TIM13 global interrupt                               */
#define IRQ_NO_TIM8_TRG_COM_TIM14   45  /* TIM8 Trigger and Commutation interrupts and TIM14 global interrupt   */
#define IRQ_NO_TIM8_CC              46  /* TIM8 Capture Compare interrupt                                       */
#define IRQ_NO_DMA1_STREAM7         47  /* DMA1 Stream7 global interrupt                                        */
#define IRQ_NO_FMC                  48  /* FMC global interrupt                                                 */
#define IRQ_NO_SDIO                 49  /* SDIO global interrupt                                                */
#define IRQ_NO_TIM5                 50  /* TIM5 global interrupt                                                */
#define IRQ_NO_SPI3                 51  /* SPI3 global interrupt                                                */
#define IRQ_NO_UART4                52  /* UART4 global interrupt                                               */
#define IRQ_NO_UART5                53  /* UART5 global interrupt                                               */
#define IRQ_NO_TIM6_DAC             54  /* TIM6 global interrupt, DAC1 and DAC2 underrun error interrupts       */
#define IRQ_NO_TIM7                 55  /* TIM7 global interrupt                                                */
#define IRQ_NO_DMA2_STREAM0         56  /* DMA2 Stream0 global interrupt                                        */
#define IRQ_NO_DMA2_STREAM1         57  /* DMA2 Stream1 global interrupt                                        */
#define IRQ_NO_DMA2_STREAM2         58  /* DMA2 Stream2 global interrupt                                        */
#define IRQ_NO_DMA2_STREAM3         59  /* DMA2 Stream3 global interrupt                                        */
#define IRQ_NO_DMA2_STREAM4         60  /* DMA2 Stream4 global interrupt                                        */
#define IRQ_NO_CAN2_TX              63  /* CAN2 TX interrupts                                                   */
#define IRQ_NO_CAN2_RX0             64  /* CAN2 RX0 interrupts                                                  */
#define IRQ_NO_CAN2_RX1             65  /* CAN2 RX1 interrupts                                                  */
#define IRQ_NO_CAN2_SCE             66  /* CAN2 SCE interrupts                                                  */
#define IRQ_NO_CAN2_OTG             67  /* USB On The Go FS global interrupt                                    */
#define IRQ_NO_DMA2_STREAM5         68  /* DMA2 Stream5 global interrupt                                        */
#define IRQ_NO_DMA2_STREAM6         69  /* DMA2 Stream6 global interrupt                                        */
#define IRQ_NO_DMA2_STREAM7         70  /* DMA2 Stream7 global interrupt                                        */
#define IRQ_NO_USART6               71  /* USART6 global interrupt                                              */
#define IRQ_NO_I2C3_EV              72  /* I2C3 event interrupt                                                 */
#define IRQ_NO_I2C3_ER              73  /* I2C3 error interrupt                                                 */
#define IRQ_NO_OTG_HS_EP1_OUT       74  /* USB On The Go HS End Point 1 Out global interrupt                    */
#define IRQ_NO_OTG_HS_EP1_IN        75  /* USB On The Go HS End Point 1 In global interrupt                     */
#define IRQ_NO_OTG_HS_WKUP          76  /* USB On The Go HS Wakeup through EXTI interrupt                       */
#define IRQ_NO_OTG_HS               77  /* USB On The Go HS global interrupt                                    */
#define IRQ_NO_DCMI                 78  /* DCMI global interrupt                                                */
#define IRQ_NO_FPU                  81  /* FPU global interrupt                                                 */
#define IRQ_NO_SPI4                 84  /* SPI4 global interrupt                                                */
#define IRQ_NO_SAI1                 87  /* SAI1 global interrupt                                                */
#define IRQ_NO_SAI2                 91  /* SAI2 global interrupt                                                */
#define IRQ_NO_QUADSPI              92  /* QuadSPI global interrupt                                             */
#define IRQ_NO_HDMI_CEC             93  /* HDMI-CEC global interrupt                                            */
#define IRQ_NO_SPDIF_RX             94  /* SPDIF-Rx global interrupt                                            */
#define IRQ_NO_FMPI2C1_EV           95  /* FMPI2C1 event interrupt                                              */
#define IRQ_NO_FMPI2C1_ER           96  /* FMPI2C1 error interrupt                                              */



/* AHB1 — GPIO clock disables */
#define GPIOA_PCLK_DI()     (RCC->AHB1ENR &= ~(1U << 0))
#define GPIOB_PCLK_DI()     (RCC->AHB1ENR &= ~(1U << 1))
#define GPIOC_PCLK_DI()     (RCC->AHB1ENR &= ~(1U << 2))
#define GPIOD_PCLK_DI()     (RCC->AHB1ENR &= ~(1U << 3))
#define GPIOE_PCLK_DI()     (RCC->AHB1ENR &= ~(1U << 4))
#define GPIOF_PCLK_DI()     (RCC->AHB1ENR &= ~(1U << 5))
#define GPIOG_PCLK_DI()     (RCC->AHB1ENR &= ~(1U << 6))
#define GPIOH_PCLK_DI()     (RCC->AHB1ENR &= ~(1U << 7))
#define GPIOI_PCLK_DI()     (RCC->AHB1ENR &= ~(1U << 8))

/* APB1 — I2C clock disables */
#define I2C1_PCLK_DI()      (RCC->APB1ENR &= ~(1U << 21))
#define I2C2_PCLK_DI()      (RCC->APB1ENR &= ~(1U << 22))
#define I2C3_PCLK_DI()      (RCC->APB1ENR &= ~(1U << 23))

/* APB1 — SPI clock disables */
#define SPI2_PCLK_DI()      (RCC->APB1ENR &= ~(1U << 14))
#define SPI3_PCLK_DI()      (RCC->APB1ENR &= ~(1U << 15))

