saitejanomula7797/stm32_Drivers_Development/drivers/Inc/stm32407xx.h
/* APB2 — SPI clock disables */
#define SPI1_PCLK_DI()      (RCC->APB2ENR &= ~(1U << 12))
#define SPI4_PCLK_DI()      (RCC->APB2ENR &= ~(1U << 13))

/* APB1 — USART/UART clock disables */
#define USART2_PCLK_DI()    (RCC->APB1ENR &= ~(1U << 17))
#define USART3_PCLK_DI()    (RCC->APB1ENR &= ~(1U << 18))
#define UART4_PCLK_DI()     (RCC->APB1ENR &= ~(1U << 19))
#define UART5_PCLK_DI()     (RCC->APB1ENR &= ~(1U << 20))

/* APB2 — USART clock disables */
#define USART1_PCLK_DI()    (RCC->APB2ENR &= ~(1U << 4))
#define USART6_PCLK_DI()    (RCC->APB2ENR &= ~(1U << 5))

/* APB2 — SYSCFG clock disable */
#define SYSCFG_PCLK_DI()    (RCC->APB2ENR &= ~(1U << 14))


/*===========================================================================
 * 11. GPIO PERIPHERAL RESET MACROS  (via RCC_AHB1RSTR)
 *     Usage: call the macro, then clear the reset bit immediately after.
 *===========================================================================*/
#define GPIOA_REG_RESET()   do { (RCC->AHB1RSTR |= (1U << 0)); (RCC->AHB1RSTR &= ~(1U << 0)); } while(0)
#define GPIOB_REG_RESET()   do { (RCC->AHB1RSTR |= (1U << 1)); (RCC->AHB1RSTR &= ~(1U << 1)); } while(0)
#define GPIOC_REG_RESET()   do { (RCC->AHB1RSTR |= (1U << 2)); (RCC->AHB1RSTR &= ~(1U << 2)); } while(0)
#define GPIOD_REG_RESET()   do { (RCC->AHB1RSTR |= (1U << 3)); (RCC->AHB1RSTR &= ~(1U << 3)); } while(0)
#define GPIOE_REG_RESET()   do { (RCC->AHB1RSTR |= (1U << 4)); (RCC->AHB1RSTR &= ~(1U << 4)); } while(0)
#define GPIOF_REG_RESET()   do { (RCC->AHB1RSTR |= (1U << 5)); (RCC->AHB1RSTR &= ~(1U << 5)); } while(0)
#define GPIOG_REG_RESET()   do { (RCC->AHB1RSTR |= (1U << 6)); (RCC->AHB1RSTR &= ~(1U << 6)); } while(0)
#define GPIOH_REG_RESET()   do { (RCC->AHB1RSTR |= (1U << 7)); (RCC->AHB1RSTR &= ~(1U << 7)); } while(0)
#define GPIOI_REG_RESET()   do { (RCC->AHB1RSTR |= (1U << 8)); (RCC->AHB1RSTR &= ~(1U << 8)); } while(0)


/*===========================================================================
 * 12. GENERIC UTILITY MACROS
 *===========================================================================*/
#define ENABLE          1
#define DISABLE         0
#define SET             ENABLE
#define RESET           DISABLE
#define GPIO_PIN_SET    SET
#define GPIO_PIN_RESET  RESET
#define FLAG_SET        SET
#define FLAG_RESET      RESET

#endif /* STM32407XX_H_ */
